{
  "add_cross_attention": false,
  "architectures": [
    "XLMRobertaForSequenceClassification"
  ],
  "attention_probs_dropout_prob": 0.1,
  "bos_token_id": 0,
  "classifier_dropout": null,
  "dtype": "float32",
  "eos_token_id": 2,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 768,
  "id2label": {
    "0": "balance_inquiry",
    "1": "transaction_history",
    "2": "transfer_money",
    "3": "account_statement",
    "4": "password_reset",
    "5": "update_profile",
    "6": "loan_inquiry",
    "7": "bill_payment",
    "8": "mobile_money",
    "9": "transaction_dispute",
    "10": "security_pin",
    "11": "network_connectivity",
    "12": "mobile_wallet_fees",
    "13": "account_closure",
    "14": "account_opening",
    "15": "card_request",
    "16": "atm_location",
    "17": "branch_location",
    "18": "escalation_request",
    "19": "general_inquiry",
    "20": "greeting",
    "21": "goodbye",
    "22": "complaint"
  },
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "is_decoder": false,
  "label2id": {
    "account_closure": 13,
    "account_opening": 14,
    "account_statement": 3,
    "atm_location": 16,
    "balance_inquiry": 0,
    "bill_payment": 7,
    "branch_location": 17,
    "card_request": 15,
    "complaint": 22,
    "escalation_request": 18,
    "general_inquiry": 19,
    "goodbye": 21,
    "greeting": 20,
    "loan_inquiry": 6,
    "mobile_money": 8,
    "mobile_wallet_fees": 12,
    "network_connectivity": 11,
    "password_reset": 4,
    "security_pin": 10,
    "transaction_dispute": 9,
    "transaction_history": 1,
    "transfer_money": 2,
    "update_profile": 5
  },
  "layer_norm_eps": 1e-05,
  "max_position_embeddings": 514,
  "model_type": "xlm-roberta",
  "num_attention_heads": 12,
  "num_hidden_layers": 12,
  "output_past": true,
  "pad_token_id": 1,
  "position_embedding_type": "absolute",
  "problem_type": "single_label_classification",
  "tie_word_embeddings": true,
  "transformers_version": "5.1.0",
  "type_vocab_size": 1,
  "use_cache": false,
  "vocab_size": 250002
}
